index.org
#+TITLE: Principle of Programming Languages
#+OPTIONS: num:nil
#+SETUPFILE: setup.org
#+HTML_HEAD: <link rel="stylesheet" href="css/index.css" type="text/css" />

-----

#+BEGIN_abstract
This course introduces the programming languages in a general way
including a formal description of grammer, lexical and syntax
analysis, i.e., parsing, and the basic components available in almost
all programming languages.  Many of the materials here are summary
from Concepts of Programming Languages (10th edition).
#+END_abstract

* Outline
  :PROPERTIES:
  :CUSTOM_ID: sec:outline
  :END:

  - [[./syllabus][Syllabus]]
  - [[./preliminary][Priliminaries]]
  - Evolution
  - Language Definition
    + [[./bnf][BNF and /e/-BNF]]
    + Attribute Grammers
    + Dynamic Semantics
      - Operational Semantics
      - Denotational Semantics
      - Axiomatic Semantics
  - Parsing
    + Lexical Analysis
    + Syntax Analysis -- Parsing
      - Top-Down Parser
      - Bottom-Up Parser
  - Basic Components
    + Variable
    + Expression
    + Flow Control
    + Subprogram
  - Samples
    + Scripting Language -- Javascript
    + Functional Language -- Emacs-Lisp
    + Logic Language -- Prolog
  - Misc
    + Data Types
      - Builtin Data Types
      - Abstract Data Types
    + OOP
    + Concurrency
    + Exception and Event


* {{{LOGO}}} -- Fall 2015
  :PROPERTIES:
  :CUSTOM_ID: sec:brief
  :END:

  me (AT) gongzhitaao (DOT) org

  Office hours (Shelby 2307) is /Tue/Thu 1430 till class/

  TA is TBA

  Course Calendar

  - Homework 1
  - Homework 2
  - Homework 3
  - Homework 4
  - Midterm Guild
  - Homework 5
  - Homework 6
  - Homework 7
  - Homework 8
  - Final Guild

* Footnotes

-----
