index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2015-08-05 Wed 16:38 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Principle of Programming Languages</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Zhitao Gong">
<meta name="description" content="COMP 3220 Principle of Programming Languages, Auburn University">
<meta name="keywords" content="comp3220, principle of programming languages, auburn university">
<link rel="stylesheet" href="/comp3220/css/normalize.css" type="text/css" />
<link rel="stylesheet" href="/comp3220/css/font-awesome.min.css" type="text/css" />
<link rel="stylesheet" href="https://gongzhitaao.github.io/orgcss/org.css" type="text/css" />
<link rel="stylesheet" href="css/index.css" type="text/css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Principle of Programming Languages</h1>
</header><hr >

<div class="abstract">
<p>
This course introduces the programming languages in a general way
including a formal description of grammer, lexical and syntax
analysis, i.e., parsing, and the basic components available in almost
all programming languages.  Many of the materials here are summary
from Concepts of Programming Languages (10th edition).
</p>

</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="sec:outline"><a id="orgheadline1"></a>Outline</h2>
<div class="outline-text-2" id="text-sec:outline">
<ul class="org-ul">
<li><a href="./syllabus">Syllabus</a></li>
<li><a href="./preliminary">Priliminaries</a></li>
<li>Evolution</li>
<li>Language Definition
<ul class="org-ul">
<li><a href="./bnf">BNF and <i>e</i>-BNF</a></li>
<li>Attribute Grammers</li>
<li>Dynamic Semantics
<ul class="org-ul">
<li>Operational Semantics</li>
<li>Denotational Semantics</li>
<li>Axiomatic Semantics</li>
</ul></li>
</ul></li>
<li>Parsing
<ul class="org-ul">
<li>Lexical Analysis</li>
<li>Syntax Analysis &#x2013; Parsing
<ul class="org-ul">
<li>Top-Down Parser</li>
<li>Bottom-Up Parser</li>
</ul></li>
</ul></li>
<li>Basic Components
<ul class="org-ul">
<li>Variable</li>
<li>Expression</li>
<li>Flow Control</li>
<li>Subprogram</li>
</ul></li>
<li>Samples
<ul class="org-ul">
<li>Scripting Language &#x2013; Javascript</li>
<li>Functional Language &#x2013; Emacs-Lisp</li>
<li>Logic Language &#x2013; Prolog</li>
</ul></li>
<li>Misc
<ul class="org-ul">
<li>Data Types
<ul class="org-ul">
<li>Builtin Data Types</li>
<li>Abstract Data Types</li>
</ul></li>
<li>OOP</li>
<li>Concurrency</li>
<li>Exception and Event</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="sec:brief"><a id="orgheadline2"></a> <span class="comp3220-logo">P<sup>2</sup>L</span> &#x2013; Fall 2015</h2>
<div class="outline-text-2" id="text-sec:brief">
<p>
me (AT) gongzhitaao (DOT) org
</p>

<p>
Office hours (Shelby 2307) is <i>Tue/Thu 1430 till class</i>
</p>

<p>
TA is TBA
</p>

<p>
Course Calendar
</p>

<ul class="org-ul">
<li>Homework 1</li>
<li>Homework 2</li>
<li>Homework 3</li>
<li>Homework 4</li>
<li>Midterm Guild</li>
<li>Homework 5</li>
<li>Homework 6</li>
<li>Homework 7</li>
<li>Homework 8</li>
<li>Final Guild</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<a class="author"
       href="http://gongzhitaao.org">Zhitao Gong</a> / <span
       class="date">2015-08-05 Wed 16:38</span><span class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.3.1)</span>
</div>
</body>
</html>
